{"version":"1","records":[{"hierarchy":{"lvl1":"Neighborliness and Belonging: A Draft of What is Going On in Our Minds"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Neighborliness and Belonging: A Draft of What is Going On in Our Minds"},"content":"This is a draft webpage. It doesn’t intend to be a reliable material for anyone or any purpose. It is where we dump our thoughts, ideas, and reflections on the themes of neighborliness and belonging. Where we share our readings, videos and other resources that inspire us to think about these topics more deeply.\n\nThis space is built by a very unique team from \n\nCalvin University. The team is awesome! Check who is there (in alphabetic order by surnames, because they are all really awesome!):\n\nEric Araújo\n\nKevin Corcoran\n\nHerman De Vries\n\nKatie Good\n\nDavid Koetje\n\nTracy Kuperus\n\nSamuel Smartt\n\nMicah Watson","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Recommended Resources"},"type":"lvl1","url":"/materials","position":0},{"hierarchy":{"lvl1":"Recommended Resources"},"content":"View the dynamic materials table","type":"content","url":"/materials","position":1},{"hierarchy":{"lvl1":"Recommended Resources"},"type":"lvl1","url":"/materials#recommended-resources","position":2},{"hierarchy":{"lvl1":"Recommended Resources"},"content":"Title\n\nType\n\nLink\n\nRecommended By\n\nNotes\n\nHow smartphones and AI are destroying our youth, democracy and sense of meaning (Jonathan Haidt)\n\nVideo\n\nWatch on YouTube\n\nHerman De Vries\n\n\n\nRevolt of the Unheard: Populism Comes to the Netherlands\n\nVideo\n\nWatch on Google Drive\n\nHerman De Vries\n\n\n\nGert-Jan Segers - In Dutch\n\nPodcast\n\nListen on NPO Radio 1\n\nHerman De Vries\n\n\n\nThey Warned Us in 1945: Fascism in America Would Look Like Patriotism\n\nArticle\n\nRead on Substack\n\nDavid Koetje\n\nInterdisciplinary attempt to understand the MAGA movement.\n\nHow America Fractured Into Four Parts\n\nArticle\n\nRead on The Atlantic\n\nDavid Koetje\n\nBy George Packer\n\nLove and Death\n\nArticle\n\nRead on Substack\n\nKristin Du Mez\n\n\n\nNYT on Mass Job Loss\n\nArticle\n\nRead on NYT\n\nKatie Good\n\n\n\nTech-Fuelled Inequality Could Catalyze Populism 2.0\n\nArticle\n\nRead on CIGI Online\n\nKatie Good\n\n\n\nWhat if Our Democracy Can’t Survive Without Christianity?\n\nArticle\n\nRead on NYT\n\nKatie Good\n\n\n\nThe Nation Encourages Political Violence by Allowing It to Seem Normal\n\nArticle\n\nRead on NYT\n\nKatie Good\n\nDesensitization to political violence.\n\nFrom Scarcity to Abundance\n\nArticle\n\nRead on Substack\n\nDavid Koetje\n\nWritten by K. Campbell\n\nOne America Movement\n\nLink\n\nVisit Site\n\nKatie Good\n\n\n\nRyan Burge\n\nLink\n\nVisit X Profile\n\nKatie Good\n\n\n\nBecoming Neighbors: The Common Good Made Local\n\nBook\n\nRead on Eerdmans\n\nKatie Good\n\nAmar D. Peterman, Eerdmans Publishing, 2026\n\nThe Righteous Mind: Why Good People Are Divided by Politics and Religion\n\nBook\n\nRead on Amazon\n\nEric Araujo\n\nJonathan Haidt, Pantheon Books, 2012\n\nThe Coddling of the American Mind: How Good Intentions and Bad Ideas Are Setting Up a Generation for Failure\n\nBook\n\nRead on Amazon\n\nEric Araujo\n\nJonathan Haidt & Greg Lukianoff, Penguin Press, 2018\n\nThe Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidemic of Mental Illness\n\nBook\n\nRead on Amazon\n\nEric Araujo\n\nJonathan Haidt, Penguin Press, 2024","type":"content","url":"/materials#recommended-resources","position":3},{"hierarchy":{"lvl1":"June 2, 2025 - Proposal Planning PROSPECTING"},"type":"lvl1","url":"/20250602","position":0},{"hierarchy":{"lvl1":"June 2, 2025 - Proposal Planning PROSPECTING"},"content":"Welcome and Intros\n\nBackground of Spring 2025 Polarisation Reading Group\n\nReview elements of a Legacy Grant (see back side)\n\nHow to refine a project?\n\nMeets expectations of a Legacy Grant\n\nTargeted, but within the broad categories of polarization/populism/pluralism\n\nPossible Questions for discussion\n\nWhat specific questions are we in a position to address?\n\nWho are the target audiences?\n\nAcademic\n\nPractitioner\n\nPublic\n\nChurch\n\nAre there obvious external partners to join in organizing the work?\n\nAre there experts to begin courting for participation with a conference or an edited work (or other venues)?\n\nDo we have 2-4 campus champions to shepherd the work (starting with planning and proposal development)\n\nNext Steps","type":"content","url":"/20250602","position":1},{"hierarchy":{"lvl1":"June 2, 2025 - Proposal Planning PROSPECTING","lvl2":"CCCS Legacy Grants"},"type":"lvl2","url":"/20250602#cccs-legacy-grants","position":2},{"hierarchy":{"lvl1":"June 2, 2025 - Proposal Planning PROSPECTING","lvl2":"CCCS Legacy Grants"},"content":"Drivers and Expectations\n\nTackle complex challenges that face humankind\n\nIntegrate the Christian faith for perspective and critique\n\nInclude a team of expert scholars and practitioners from (multiple and complementary) disciplines necessary to adequately address the problem. Calvin and external participants\n\nConnect to Vision 2030 for Calvin University\n\nIncorporate partner programs of Calvin University\n\nProduce scholarly products\n\nTranslate and disseminate scholarly findings for public audiences, including the Church\n\nEnfold students and extend results into the student experience\n\nLeverage results to secure future external funding\n\nConnections to the student learning at Calvin (Core curriculum: cross-disciplinary integration focus)\n\ndirect connections to contemporary challenges and enduring questions course designation\n\n**-> apply cross-disciplinary perspectives to examine enduring question and to address contemporary challenges and begin living out your vocation in Christian witness to the world\n**\n\nextended connections to engaged citizenship tags (i.e., diversity and difference, environmental sustainability, and global regions and cultures)\n\nElements/Phases:\n\nPlanning Phase (summer): development of proposals\n\nLaunch Phase (year 1): public event and follow-on activities\n\nProduction Phase (year 2): workshop and scholarship production\n\nLanding Phase (year 3): scholarship dissemination (academic and public) and proposals to external funders\n\nFunding\n\nCCCS has substantial fund balance and annual endowment draw—sufficient to support ~2-3 Legacy Grants (over next 3-5 years). Up to $150K per grant.","type":"content","url":"/20250602#cccs-legacy-grants","position":3},{"hierarchy":{"lvl1":"June 30, 2025 - Proposal Planning PROSPECTING"},"type":"lvl1","url":"/20250630","position":0},{"hierarchy":{"lvl1":"June 30, 2025 - Proposal Planning PROSPECTING"},"content":"Katie Good\n\nNeighborhoods, communities, and the weakening of social bonds.\n\nEric\n\nThinking of the academic side of the project.\n\nSam\n\nThe discussion about the fluoride in water and people’s opinions on it.\n\nMeet in the middle (academic and public).\n\nTaylor\n\n1st year - Coloquium on Polarization and Pluralism\n2nd and 3rd year - Scholarship work.\n\nHerman De Vries\n\nHow do we speak with each other in a polarized world? How do we listen to each other? How do we learn from each other? How do we work together to address the challenges of our time?\n\nDavid Koetje\n\nHow to hold it together? Reconignizing the causes of polarization and how to address them.\n\nWhat are some principles, values, and practices that can help us to live together in a pluralistic society? Personally and as a community?\n\nDiscussion on social media and people’s reactions towards different opinions.\n\nSam\n\nDiscussion about goodness or badness of the terms populism, polarization, and pluralism.\n\nWhy is polarization bad?\n\nMicah\n\nThe different types of polarization. Affective polarization (I can’t stand staying in the same room as you), ideological polarization (we disagree but we can stand each other).\n\nThe two axis for political positions: economic and social.\n\nEric\n\nDiscussion about populism in constrast to pluralism and polarization.\n\nKatie Good\n\nNot using these 3 terms in the name of the project.\n\nMicah\n\nWho is our neighbor?\n\n1st year - Global\n2nd year - National\n3rd year - Local\n\nKatie Good\n\nUnderstanding in different concentric circles.\n\nWould start with the local.\n\nEric and Herman De Vries\n\nThinking about a name that brings us together.\n\nSuggestion: The Link Project\n\nDavid Koetje gave a very good example of how life in biology depends on polarization.\n\nSam: good faith on how we approach other people. Aristotle’s idea of the golden mean.\n\nDavid Wunder\n\nPresumptions, questions, measures and objectives. One page document from small groups.","type":"content","url":"/20250630","position":1},{"hierarchy":{"lvl1":"Meeting Notes - August 7, 2025"},"type":"lvl1","url":"/20250807","position":0},{"hierarchy":{"lvl1":"Meeting Notes - August 7, 2025"},"content":"Tracy on the falleness of our world, and how that caused self-justification and the need to be right.\n\nHow would it be different in a perfect world?\n\nWolterstoff on shalom.","type":"content","url":"/20250807","position":1},{"hierarchy":{"lvl1":"Bridging the Divide: Neighborliness and Belonging (Third draft)"},"type":"lvl1","url":"/bridging","position":0},{"hierarchy":{"lvl1":"Bridging the Divide: Neighborliness and Belonging (Third draft)"},"content":"Our focus. In a world more interconnected than ever, we often feel disconnected and estranged. Social media that was meant to bring us together pulls us apart. Once accepted facts are now disputed. Expertise is suspect. Institutions are fraying. In such a polarized world, how do we bridge divisions? Our project focuses on applying wisdom to polarization in a way that reflects Jesus’ response to the lawyer’s question, “Who is my neighbor?” (Luke 10:29b)\n\nThat question arose when Jesus taught to love one’s neighbor as oneself. Jesus responded with the parable of the Good Samaritan, illustrating that a neighbor is anyone in need, even a perceived enemy or member of a different “tribe.” In our fragmented world, we find direction for bridge-building—not with the aim of changing minds, but of loving all people as image-bearers of God.\n\nDisciplines and Partners. Fostering neighborliness requires virtues such as humility, curiosity, and empathy. Disciplinary perspectives can help identify the causes and consequences of polarization and suggest possible paths forward for ameliorating its harms. While biologists might point out the necessary polarization within living systems, philosophers, sociologists, and historians help us understand diverse human responses to the challenges of building community and sharing governance amid conflict. Artists, filmmakers, musicians, and writers create media that illuminate the human condition and provoke our social imaginations.\n\nLearning to love and serve our neighbors also requires learning from other cultures. Calvin’s global reach enables us to approach neighborliness in an international way. The reading-group inception of this project invites further collaboration with scholars and churches in the Netherlands, a country with a tradition of (Kuyperian) pluralism, as well as in Brazil and Ghana through networks cultivated by Calvin scholars.\n\nTarget Audiences and Outcomes. In year one, we aim to coordinate with international partners to convene and gather data from multiple community-oriented discussion groups both local (Grand Rapids) and abroad (the Netherlands and partners in the Global South) organized around common readings, film viewings and other cultural works of art focused on bridging divides. Locally, we will host interdisciplinary colloquia on campus that seek wide public participation from the Grand Rapids community. In year two, we will invite paper and presentation submissions and host, on Calvin’s campus, an interdisciplinary workshop focused on bridge-building and polarization. In year three, the fruit of the workshop will be gathered and published in a special “bridging divisions” issue of an open-access, interdisciplinary journal (e.g., Christian Scholar’s Review, or an equivalent). We will also publish and promote these results more widely in various public-facing venues, including podcasts and YouTube videos, etc. (Add mention of applying for external funding in year 3, a condition of Legacy Grants).\n\nStudent involvement. We will hire Calvin students as research assistants in all three years of this project. In year one, they will help convene and gather data from the community discussion groups and integrate related discussions into Calvin courses. In year two, they will help organize and host the interdisciplinary workshop. In year three, they will help produce the open-access scholarship and podcast interviews, YouTube videos, or other public-facing media about the research. Through this, students will test ideas, build skills, and practice strategies for seeking unity out of plurality.\n\nChristian perspective. Tying all the above together are the unique insights of Reformed Christianity. Its emphasis on both structural and confessional pluralism can bridge the divides that are at times tearing us apart. Christians committed to change that addresses both personal relationships and structures can contribute to flourishing communities where people hold firmly to their core beliefs and pursue their mutual interests.","type":"content","url":"/bridging","position":1}]}